Autodesk.Revit.DB.ATFTranslationServiceGeometryData.SetResult(System.Collections.Generic.IList{Autodesk.Revit.DB.Blob})
Set the binary objects resulting from geometry serialization.
result:
The serialized geometry objects.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ATFTranslationServiceGeometryData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ATFTranslationServiceGeometryData.Document
Gets the document containing the data to be translated.

Autodesk.Revit.DB.ATFTranslationServiceGeometryData.SerializationOptions
Export options used for geometry serialization.

Autodesk.Revit.DB.ATFTranslationServiceGeometryData
This is a container for basic geometry data which is passed from Revit to an instance of IATFTranslationServer.